tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "osx-cross/avr"
tap "px4/px4"
brew "asciinema"
brew "avrdude"
brew "bash"
brew "bash-completion@2"
brew "bash-git-prompt"
brew "cask"
brew "dfu-programmer"
brew "ffmpeg"
brew "git"
brew "imagemagick@6"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "rbenv-gemset"
brew "tmux"
brew "vim"
brew "yarn", args: ["without-node"]
brew "osx-cross/avr/avr-gcc@7"
brew "px4/px4/gcc-arm-none-eabi"
cask "emacs"
