tap "homebrew/cask"

cask_args appdir: "/Applications"

brew "fzf"
brew "git"
brew "tmux"
brew "vim"
brew "imagemagick"
brew "asciinema"
brew "jq"
brew "postgresql"
brew "mysql"
brew "openssl"
brew "ansible"
brew "anyenv"
brew "mas"
brew "awscli"
brew "bat"
brew "ripgrep"
brew "exa"
brew "hexyl"
brew "fd"
brew "procs"
brew "terminal-notifier"
brew "zplug"
brew "tree"
brew "zsh"
brew "zsh-completions"
brew "yarn"
brew "gcc"
brew "cocoapods"
brew "watchman"
brew "redis"
brew "neovim", args: ['HEAD']
brew "kubectx"
brew "graphviz"
brew "plantuml"

tap "facebook/fb"
brew "idb-companion"

tap "mongodb/brew"
brew "mongodb-community@4.4"

tap "homebrew-ffmpeg/ffmpeg"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ['HEAD', 'with-fdk-aac']

# cask "inkscape"
# cask "kicad"

cask "docker"
cask "virtualbox"
cask "firefox"
cask "google-chrome"
cask "google-japanese-ime"
cask "google-backup-and-sync"
cask "iterm2"
cask "karabiner-elements"
cask "visual-studio-code"
cask "arduino"
cask "discord"
cask "slack"
cask "dropbox"
cask "skype"
cask "vlc"
cask "appcleaner"
cask "alfred"
cask "imageoptim"
cask "shiftit"
cask "aws-vault"
cask "java"
cask "adoptopenjdk"
cask "android-studio"
cask "genymotion"
cask "google-cloud-sdk"
cask "flipper"
cask "react-native-debugger"
cask "ngrok"
cask "dynalist"
cask "clip-studio-paint"
cask "pycharm-ce"
cask "blackhole-2ch"
cask "blackhole-16ch"

mas "Xcode", id:497799835
mas "HexFiend", id:1342896380
# max "LadioCast", id:411213048

